const countries = [
    '全部',
    '中国大陆',
    '中国香港',
    '中国台湾',
    '美国',
    '法国',
    '英国',
    '日本',
    '韩国',
    '德国',
    '泰国',
    '印度',
    '意大利',
    '西班牙',
    '加拿大',
    '其他'
]
const genres = [
    '全部',
    '冒险',
    '剧情',
    '动作',
    '动画',
    '华语',
    '古装',
    '喜剧',
    '奇幻',
    '家庭',
    '恐怖',
    '日韩',
    '武侠',
    '灾难',
    '爱情',
    '犯罪',
    '神秘'
]
const years = [
    '全部',
    '2020',
    '2019',
    '2018',
    '2017',
    '2016',
    '2015',
    '2014',
    '2013',
    '2012',
    '2011',
    '2010',
    '2009',
    '2008',
    '2007',
    '2006',
    '2005',
]

export const tags = [
    {
        type: 'countries',
        values: countries,
        name: '国 家',
        flag: -1
    },
    {
        type: 'genres',
        values: genres,
        name: '类 别',
        flag: -1
    },
    {
        type: 'year',
        values: years,
        name: '年 份',
        flag: -1
    },
]
